# Используем официальный Node.js образ
FROM node:19-alpine

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Копируем все содержимое текущей директории в рабочую директорию контейнера
COPY . .

# Устанавливаем зависимости
RUN npm i

# Переходим в директорию frontend и собираем проект
RUN npm run build

# Открываем порты, которые будут использоваться приложением
EXPOSE 3000

# Команда для запуска приложения
CMD ["npm", "run", "start"]